### Базовые типы данных и вычисления. Ввод вывод. Базовые операции

* Предположим требуется написать программу которая ведет учет кол-ва товара не складе. У нас есть переменная **stock** - целого типа, она "помнит" сколько продуктов на складе.
* Внутри **main()** добавим такой код
    ```c
    int stock = 10;
    int take;
    printf("Products in stock: %d\n");
    printf("How many products do you want?");
    scanf("%d", &take);

    // ???
    ```
    где переменная **take** - дает возможность пользователю указать кол-во продуктов что он хочет забрать со склада.

* Исходя из условий требуется:
  1. дополнить в коде вместо ```???``` то что приведет к выводу такого результата
     ```
     Products in stock: 10
     How many products do you want? 3
     You have taken 3 products, products left in stock: 7
     ``` 
     простыми словами, после ввода со стороны пользователя, подтвердить в сообщении сколько он забрал и сколько осталось на складе!