# предположим 
# 0 - пустота -  '.'
# 1 - стена   -  '#'
# 9 - робот   -  '@'

data_map = [
  # 0 1 2 3 4 5 6 7 8 9  
   [0,0,0,0,0,0,0,0,0,0],   # 0
   [0,0,0,0,0,0,0,0,0,0],   # 1
   [0,0,0,0,0,0,0,0,0,0],   # 2
   [0,0,0,0,0,0,0,0,0,0],   # 3
   [0,0,0,0,0,0,0,0,1,0],   # 4
   [0,0,0,0,0,0,9,0,1,0],   # 5
   [0,0,0,0,0,0,0,0,1,0],   # 6
   [0,0,0,0,0,0,0,0,0,0],   # 7
   [0,0,0,0,0,0,0,0,0,0],   # 8
   [0,0,0,0,0,0,0,0,0,0],   # 9
]
#выше приведен двухмерный список с размерами 10х10


def show_map():
    out = ""
    for row in range(10):
        for col in range(10):
            #print(data_map[row][col])
            # добавить if/else так чтобы цифры заменялись на экране
            # соответствующими символами
            out += str(data_map[row][col]) # str(целое число) преобразует число в строку аа
        out += "\n"    
    print(out)      


show_map()

# правельный результат

# ..........
# ..........
# ..........
# ..........
# ........#.
# ......@.#.
# ........#.
# ..........
# ..........
# ..........